In [2]:
from sqlalchemy import create_engine, text

In [3]:
import pandas as pd

In [4]:
database_name = 'scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [5]:
connection_string

'postgresql://postgres:postgres@localhost:5432/scooters'

In [6]:
engine = create_engine(connection_string)

In [7]:
query = '''
SELECT *
FROM scooters
LIMIT 10;
'''

with engine.connect() as connection:
    result = connection.execute(text(query))

In [10]:
with engine.connect() as connection:
    scooter_table = pd.read_sql(text(query), con = connection)

scooter_table.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [11]:
query2 = '''
SELECT *
FROM trips
LIMIT 10;
'''

with engine.connect() as connection:
    result = connection.execute(text(query2))

In [13]:
with engine.connect() as connection:
    trips_table = pd.read_sql(text(query2), con = connection)

trips_table.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [23]:
query3 = '''
select count(*) as total_number_of_null
from scooters
where chargelevel IS NULL 
'''

with engine.connect() as connection:
    result = connection.execute(text(query3))
    
with engine.connect() as connection:
    nulls_within_chargelevel = pd.read_sql(text(query3), con = connection)

nulls_within_chargelevel

   total_number_of_null
0                   770

In [24]:
query4 = '''
select 
	min(pubdatetime) as first_date,
	max(pubdatetime) as last_date
from scooters
'''

with engine.connect() as connection:
    result = connection.execute(text(query4))
    
with engine.connect() as connection:
    daterange_for_pubdatetime = pd.read_sql(text(query4), con = connection)

daterange_for_pubdatetime

               first_date           last_date
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57